Blog/app/views/comments/_comment.html.erb

  <strong>Commenter:</strong>
  <%= "#{User.find_by_id(comment.user_id).name}" if User.exists?(comment.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]