Blog/app/views/articles/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = ?  [["article_id", 7]]
---
      <% cats = [] %>
      <% article.categories.each do |c| %>