Blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 2]]
---
def edit
  @article = Article.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? LIMIT 1  [["category", "karimCat"]]
INSERT INTO "articles" ("title", "text", "users_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "14115515"], ["text", "4124124"], ["users_id", 1], ["created_at", "2015-02-20 17:32:36.855489"], ["updated_at", "2015-02-20 17:32:36.855489"]]
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "karimCat"], ["created_at", "2015-02-20 19:44:06.353759"], ["updated_at", "2015-02-20 19:44:06.353759"]]
---
def create
  category = Category.find_by_category(params[:article][:category][:category])
  hash = article_params
  hash[:user_id] = @current_user.id
	@article = Article.new(hash)
  if @article.save
    if category == nil
      category = Category.create(:category => params[:article][:category][:category]) if not params[:article][:category][:category].blank?

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 2]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "aklsjdlkasjdlkajasdasda"], ["updated_at", "2015-02-18 03:12:18.497408"], ["id", 2]]
---
def update
  @article = Article.find(params[:id])

  if @article.update(article_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "articles".* FROM "articles" INNER JOIN "articles_categories" ON "articles"."id" = "articles_categories"."article_id" WHERE "articles_categories"."category_id" = ?  ORDER BY "articles"."created_at" DESC  [["category_id", 1]]
SELECT "articles".* FROM "articles"  ORDER BY "articles"."created_at" DESC
---
def index
  if params[:category] != nil
    @article = Category.find_by_id(params[:category][:category]).articles
  else
  	@article = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 1]]
---
def show
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
---
def destroy
  @article = Article.find(params[:id])
  @article.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? LIMIT 1  [["category", "Food"]]
---
  def addcategory2
    category = Category.find_by_category(params[:category][:category])