Blog/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "mohamed.yasser.abdel.razek@gmail.com"], ["password_digest", "$2a$10$kAAqJ0NAZf46413gs6Rq3u0/RN8dgQCmflX78rvPTTBuVbIHPE3Jy"], ["updated_at", "2015-02-17 11:04:43.868747"], ["id", 1]]
---
 def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)