SignUp/app/controllers/articles_controller.rb

def edit
  @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 2]]

def create
<<<<<<< HEAD
   @article = Article.new(article_params)
   @article.user_id = current_user.id
=======
   category = Category.find_by_category(params[:article][:category][:category])
  hash = article_params
  hash[:user_id] = current_user.id
  @article = Article.new(hash)
>>>>>>> 5eb42be2eea0344bb1dd7c13e0387ade6e81709c
    if @article.save
      if params[:photos].present?
    params[:photos]['image'].each do |a|
    @photo = @article.photos.create!(:image => a, :article_id => @article.id)
---
INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdasdasdaas"], ["text", "asdasdadsadsa"], ["user_id", 1], ["created_at", "2015-02-20 18:50:37.287360"], ["updated_at", "2015-02-20 18:50:37.287360"]]
INSERT INTO "photos" ("image", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "canberra_hero_image.jpg"], ["article_id", 9], ["created_at", "2015-02-20 06:08:11.500660"], ["updated_at", "2015-02-20 06:08:11.500660"]]

def update
  @article = Article.find(params[:id])

  if @article.update(article_params)
     if params[:photos].present?
    params[:photos]['image'].each do |a|
    @photo = @article.photos.create!(:image => a, :article_id => @article.id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 2]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Lorem ipsum"], ["text", "Lorem ipsum"], ["updated_at", "2015-02-20 18:42:59.487027"], ["id", 1]]
INSERT INTO "photos" ("image", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "Green-Snake-Image-Wallpaper.jpg"], ["article_id", 9], ["created_at", "2015-02-20 06:20:37.601173"], ["updated_at", "2015-02-20 06:20:37.601173"]]

def index
<<<<<<< HEAD
	@articles = Article.paginate(:page => params[:page], :per_page => 3)
end
=======
	if params[:category] != nil
    @article = Category.find_by_id(params[:category][:category]).articles
---
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."created_at" DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "articles"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]

def show
    @article = Article.find(params[:id])
    @photos = @article.photos.all
    @post_by = User.find_by(id: @article.user_id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."article_id" = ?  [["article_id", 9]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

def destroy
  @article = Article.find(params[:id])
  @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]

  def addcategory2
    category = Category.find_by_category(params[:category][:category])
    if category == nil
      category = Category.create(:category => params[:category][:category])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? LIMIT 1  [["category", "ABC"]]
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "ABC"], ["created_at", "2015-02-22 11:01:57.855118"], ["updated_at", "2015-02-22 11:01:57.855118"]]