SignUp/app/controllers/comments_controller.rb

	  def create
    @article = Article.find(params[:article_id])
    @user = current_user
    @comment = @article.comments.new(comment_params)
    @comment.user_id= current_user.id
    @comment.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "aklklsdf;lk;s"], ["body", "cmx.cml;lkdg"], ["article_id", 1], ["created_at", "2015-02-16 15:51:09.879803"], ["updated_at", "2015-02-16 15:51:09.879803"]]

 def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 1], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]