SignUp/app/views/articles/_article.html.erb

                <hr>
                    <% article.photos.first(1).each do |p| %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."article_id" = ?  ORDER BY "photos"."id" ASC LIMIT 1  [["article_id", 28]]


                <% if article.categories.present? %>
---
SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = ?  [["article_id", 28]]